2Ô∏è‚É£ Sales Data Analysis

Dataset idea: Daily product sales

Tasks:

Total sales revenue

Best-selling product

Monthly sales summary

Top 5 customers

Find low-performing products

üëâ Skills: groupby, sum(), pivot tables

### Step 1: Create Dataset (Manually)

In [1]:
import pandas as pd

In [8]:
data = {
    "Order ID": [1,2,3,4,5,6,7,8,9,10],
    "Date":["2025-01-05","2025-01-12","2025-02-10","2025-02-18",
            "2025-03-02","2025-03-15","2025-04-01","2025-04-20",
            "2025-05-05","2025-05-22"],
    "Products":["Laptop","Mobile","Laptop","Tablet","Mobile",
                "Headphones","Laptop","Tablet","Mobile","Laptop"],
    "Region":["North","South","East","West","North",
               "South","East","West","North","South"],
    "Quantity": [2,3,1,4,2,5,1,2,3,2],
    "Price": [50000,20000,50000,15000,20000,
              3000,52000,16000,21000,51000]
}
    
df = pd.DataFrame(data)
df["Date"]=pd.to_datetime(df["Date"])
df.head()

   Order ID       Date Products Region  Quantity  Price
0         1 2025-01-05   Laptop  North         2  50000
1         2 2025-01-12   Mobile  South         3  20000
2         3 2025-02-10   Laptop   East         1  50000
3         4 2025-02-18   Tablet   West         4  15000
4         5 2025-03-02   Mobile  North         2  20000

### Step 2: Create Revenue Column

In [11]:
df["Revenue"] = df["Price"]*df["Quantity"]
df.head(2)

   Order ID       Date Products Region  Quantity  Price  Revenue
0         1 2025-01-05   Laptop  North         2  50000   100000
1         2 2025-01-12   Mobile  South         3  20000    60000

### Analysis Part

## Step-1: Total Revenue

In [12]:
total_revenue = df["Revenue"].sum()
print("Total Revenue:", total_revenue)

Total Revenue: 574000

## Step-2: Best-Selling Product (Revenue Based)

In [13]:
df.groupby("Products")["Revenue"].sum().sort_values(ascending = False)

Products
Laptop        304000
Mobile        163000
Tablet         92000
Headphones     15000
Name: Revenue, dtype: int64

## Step-3: Region-wise Performance

In [14]:
df.groupby("Region")["Revenue"].sum()

Region
East     102000
North    203000
South    177000
West      92000
Name: Revenue, dtype: int64

## Step-4 : Monthly Sales Summary

In [16]:
#First extract month:
df["Month"] = df["Date"].dt.month

#Then group:
df.groupby("Month")["Revenue"].sum()

Month
1    160000
2    110000
3     55000
4     84000
5    165000
Name: Revenue, dtype: int64

## Step-5 : Monthly Growth Rate

In [19]:
monthly_sales = df.groupby("Month")["Revenue"].sum()
growth_rate = monthly_sales.pct_change() * 100  
#it calculates: (Current‚àíPrevious‚Äã)/ previous
growth_rate

Month
1          NaN
2   -31.250000
3   -50.000000
4    52.727273
5    96.428571
Name: Revenue, dtype: float64

## Step-6:Top 3 Highest Orders

In [17]:
df.sort_values("Revenue",ascending = False).head(3)

   Order ID       Date Products Region  Quantity  Price  Revenue  Month
9        10 2025-05-22   Laptop  South         2  51000   102000      5
0         1 2025-01-05   Laptop  North         2  50000   100000      1
8         9 2025-05-05   Mobile  North         3  21000    63000      5